cases/openfoam.org/arbitraryWaterPump/system/foamDictionaryDict
{
    -entry baffle_master -set fanPressureJump
}
